// JavaScript类型可以分为两类：原始类型和对象类型。
// 原始类型：字符串，数值，布尔值，undefined, null, Symbol(符号) 
// 对象类型：对象是属性的集合，其中每个属性都有一个名字和一个值（原始值或其他对象）。特殊对象，数组：数组表示一个数字值的有序集合。
// Set对象表示一组值的集合，Map对象表示键与值的映射。
// RegExp类型表示文本模式，可以实现对字符串的复杂匹配，搜索和替换操作。
// Date类型表示日期和时间，支持基本的日期计算。
// Error及其子类型表示JavaScript代码运行期间可能发生的错误。

// 在内存管理方面，JavaScript解释器会执行自动垃圾收集。

// 3.2 数值：类型Number用于表示整数和近似实数。
// js支持几种形式的数值字面量：
// 整数字面量；支持十六进制（基数是16）值。十六进制字面量以0x或0x开头，后跟一个十六进制数字字符串。
0
0b10101 // 21: (1*16 + 0*8 + 1*4 + 0*2 十 1*1)
// 浮点字面量：可以包含小数点，也可以使用指数记数法表示
3.14
6.02e23 // 6.02 ✖️ 10 23次方

